When(/^заказ отображается в статусе "([^"]*)"$/) do |status|
  page.has_content?(status)
end

When(/^клиент создал новый заказ$/) do
  step "в приложении есть заказчик"
  step "он заходит в систему"
  step "клиент создаст заказ"
end

When(/^клиент решил удалить созданный заказ$/) do
  step "в приложении есть заказчик"
  step "у клиента есть заказ в статусе open"
  step "он заходит в систему"
  step "он перейдёт на страницу просмотра этого заказа"
  step "он увидит кнопку удалить заказ"
  step "он нажмёт кнопку удалить заказ"
end

When(/^клиент одобрил предложение перевозчика$/) do
  step "в приложении есть заказчик"
  step "у заказчика есть заказ"

  step "в приложении есть перевозчик"
  step "у перевозчика есть предложение"
  step "заказчик выбрал предложение перевозчика"

  step "клиент заходит в систему"
end

When(/^перевозчик с заказчиком договорились о выполнении работы$/) do
  step "в приложении есть заказчик"
  step "у заказчика есть заказ"

  step "в приложении есть перевозчик"
  step "у перевозчика есть предложение"
  step "заказчик выбрал предложение перевозчика"
end

When(/^заказчик завершает заказ$/) do
  step "клиент заходит в систему"
  visit('/orders')
  click_on('Информация')
  click_on('complete_order')
end

When(/^перевозчик завершает заказ$/) do
  step "водитель заходит в систему"
  visit('/orders/my')
  click_on('Информация')
  click_on('complete_order')
end
