When(/^заказ отображается в статусе "([^"]*)"$/) do |status|
  visit('/orders')
  click_on('Информация')
  page.has_content?(status)
end

When(/^клиент создал новый заказ$/) do
  step "в приложении есть заказчик"
  step "он заходит в систему"
  step "клиент создаст заказ"
end

When(/^клиент решил удалить созданный заказ$/) do
  step "в приложении есть заказчик"
  step "у клиента есть заказ в статусе open"
  step "он заходит в систему"
  step "он перейдёт на страницу просмотра этого заказа"
  step "он увидит кнопку удалить заказ"
  step "он нажмёт кнопку удалить заказ"
end

When(/^клиент одобрил предложение перевозчика$/) do
  step "в приложении есть заказчик"
end

When(/^заказ выполнен$/) do
  pending
end

When(/^заказчик завершает заказ$/) do
  pending
end

When(/^перевозчик завершает заказ$/) do
  pending
end