# language: ru

Функционал: Управление пользователями
  Как администратор
  Я хочу иметь возможность управлять пользователями
  Чтобы добавлять, изменять и удалять пользователей

  Предыстория:
    Дано перевозчик с телефоном "0555555555"
    Допустим в приложении есть администратор
    И он заходит в систему

  Сценарий: Создание пользователя:
    Если захожу на страницу добавления пользователя в админ панели
    И ввожу данные
      | name  | surname | phone      | password | password_confirmation |
      | Peter | Jackson | 0555223344 | qweqwe   | qweqwe                |
    Если нажму кнопку  Создать Пользователя
    То я увижу созданного водителя "Peter" на странице всех водителей

  Сценарий: Изменение данных пользователя
    Если захожу на страницу пользователей в админ панели
    И нажимаю кнопку Edit напротив водителя "0555555555"
    И введу новые данные
      | name  | surname | phone      |
      | Guffy | Dog     | 0777224455 |
    Если я нажму кнопку Сохранить Пользователя
    То я увижу измененого водителя "Guffy" на странице всех водителей

  @javascript
  Сценарий: Удаления пользователя
    Если захожу на страницу пользователей в админ панели
    И нажимаю кнопку Удалить напротив водителя "0555555555"
    То я не увижу пользователя "0555555555" на странице всех водителей