# language: ru

Функционал: В приложении должна быть возможность
  чтобы не зарегистрированные пользователи
  и зарегистрированные заказчики
  могли оставить заявку на рассчёт стоимости перевозки

  Сценарий: Не зарегистрированный пользователь оставляет заявку на рассчёт стоимости
    Дано я не зарегистрирован и зашёл на сайт
    Если я заполню форму и нажму кнопку "расчитать"
    То выйдет надпись: "Ваша заявка была принята. Наш менеджер свяжется с вами."

  Сценарий: Зарегистрированный заказчик может оставить заявку на рассчёт стоимости
    Допустим в приложении есть заказчик
    И он заходит в систему
    Если он создаст заявку
    То выйдет надпись: "Ваша заявка была принята. Наш менеджер свяжется с вами."