# language: ru

Функционал: Тестирование бизнесс процесса в приложении

  Сценарий: Новые заказы создаются в статусе "open"
    Если клиент создал новый заказ
    То заказ отображается в статусе "open"

  Сценарий: Удалённые заказы переходят в статус "closed"
    Если клиент решил удалить созданный заказ
    То заказ отображается в статусе "closed"

  @todo
  @wip
  @javascript
  Сценарий: Если клиент выбрал перевозчика заказ меняет статус на "in_progress"
    Если клиент одобрил предложение перевозчика
    То заказ отображается в статусе "in_progress"

  @todo
  Сценарий: Оба участника сделки могут её завершить
    Если заказ выполнен
    И заказчик завершает заказ
    То заказ отображается в статусе "completed"

  @todo
  Сценарий: Оба участника сделки могут её завершить
    Если заказ выполнен
    И перевозчик завершает заказ
    То заказ отображается в статусе "completed"

