# language: ru

Функционал: Клиент создаёт и удаляет заказ
  Как клиент
  Я хочу иметь возможность создать и удалить заказ

 @wip
  Сценарий: Клиент создаёт заказ
    Допустим я захожу на сайт как клиент с email "customer0@mail.com" password "qweqwe"
    Если я перейду на страницу создания заказа
    И заполню форму данными
      | from   | to | what   | cost    | desc    |
      | Бишкек | Ош | cocain | 100 000 | стелсом |
    И нажму на кнопку создать заказ
    То меня перенаправит на страницу всех заказов
    И я увижу там мой заказ
      | from   | to | what   | cost    | desc    |
      | Бишкек | Ош | cocain | 100 000 | стелсом |