# language: ru

Функционал: Клиент создаёт и удаляет заказ
  Как клиент
  Я хочу иметь возможность создать и удалить заказ

  Предыстория:
    Допустим в приложении есть заказчик
    Если он заходит в систему

  Сценарий: Клиент создаёт заказ
    Если он перейдёт на страницу создания заказа
    И заполнит форму данными
      | from   | to | what   | cost    | desc    |
      | Бишкек | Ош | cocain | 100 000 | стелсом |
    И нажмёт на кнопку создать заказ
    То его перенаправит на страницу своих заказов и он увидит там свой заказ
      | from   | to | what   | cost    | desc    |
      | Бишкек | Ош | cocain | 100 000 | стелсом |

  Сценарий: Клиент удаляет созданный заказ
    Если у клиента есть заказ в статусе open
    И он перейдёт на страницу просмотра этого заказа
    То он увидит кнопку удалить заказ
    Если я нажму кнопку удалить заказ
    То статус заказа перейдёт в closed