# language: ru

Функционал: Клиент создаёт и удаляет заказ
  Как клиент
  Я хочу иметь возможность создать и удалить заказ

  Предыстория:
    Допустим в приложении есть заказчик
    Если он заходит в систему

  Сценарий: Клиент создаёт заказ
    Если клиент создаст заказ
    То его перенаправит на страницу своих заказов и он увидит там свой заказ

  Сценарий: Клиент удаляет созданный заказ
    Если у клиента есть заказ в статусе open
    И он перейдёт на страницу просмотра этого заказа
    То он увидит кнопку удалить заказ
    Если он нажмёт кнопку удалить заказ
    То статус заказа перейдёт в closed