# language: ru

Функционал: Управление предложениями
  Как перевозчик
  Я хочу иметь возможность добавлять, редактировать и удалять свои предложения
  Чтобы они были доступны для принятия или отклонения заказчиком

  Сценарий: создание предложения
    Допустим залогинен пользователь с email: "worker0@mail.com" и паролем "qweqwe"
    Если он зайдет на страницу заказа
    И создаст предложение
    То ему надо заполнить форму предложения следующими данными
      | about |
      | Готов отвезти за 50000 сом |
    И он увидит созданное предложение "Готов отвезти за 50000 сом" на странице соответствующего заказа
    И форма для добавления предложения изчезнет

  Сценарий: редактирование предложения
    Допустим залогинен пользователь с email: "worker0@mail.com" и паролем "qweqwe"
    И создаст предложение
    То ему надо заполнить форму предложения следующими данными
      | about |
      | Готов отвезти за 50000 сом |
    И нажмет на ссылку "Изменить"
#    То он увидит форму для редактирования своего предложения
    Если он введет новые данные
      | about |
      | Готов отвезти за 40000 сом |
    И отредактированное предложение "Готов отвезти за 40000 сом" появится под заказом
    То форма для заполнения исчезнет

  Сценарий: удаление предложения
    Допустим залогинен пользователь с email: "worker0@mail.com" и паролем "qweqwe"
    Если он зайдет на страницу заказа
    И создаст предложение
    То ему надо заполнить форму предложения следующими данными
      | about |
      | Готов отвезти за 50000 сом |
    И кликнет ссылку "Удалить"
    То его предложение "Готов отвезти за 50000 сом" будет удалено
    И на странице появится форма для заполнения предложения

