# language: ru

Функционал: Управление заказами
  Как заказчик
  Я хочу иметь возможность доабавлять заказы
  Чтобы они были доступны для просмотра

  @wip
  Сценарий: создание заказа и удаление
  Допустим залогинен пользователь с email: "customer0@mail.com" и паролем "qweqwe"
    Если зайдет на страницу добавления заказа
    И заполнит форму заказа данными
      | from   | where  | cargo | price    | about | weight | volume | transport | payment   | temp  | load    |
      | Ош     | Бишкек | Лес   | 1000 руб | текст | 10     | 200    | 10 тонн   | наличными | 15-30 | верхний |
    То я увижу созданный заказ на странице моих заказов
    Если зайдет на страницу своих заказов
    И выберет на ней последний заказ
    И нажмет на кнопку "Удалить заказ"
    То заказа не будет видно на странице
