# language: ru

Функционал: Управление заказами
  Как заказчик
  Я хочу иметь возможность доабавлять заказы
  Чтобы они были доступны для просмотра

  Сценарий: создание заказа
  Допустим залогинен пользователь с email: "customer@mail.com0" и паролем "qweqwe"
    Если зайдет на страницу добавления заказа
    И заполнит форму заказа данными
      | about                                      |
      | Какоето описание для теста создания заказа |
    То я увижу созданный заказ на странице моих заказов
