# language: ru

Функционал: Подтверждение номера телефона
  Как пользователь
  Я хочу иметь возможность подтвердить номер телефона
  Чтобы иметь возможность создавать заказы
  Как администратор
  Я хочу иметь возможность
  Проверить номер телефона пользователя вручную

  Сценарий: Подтверждение номера телефона пользователем
    Допустим в системе есть пользователь с неподтвержденным номером "555777888"
    Если он заходит в систему
    И перейдет на страницу подтверждения номера телефона
    И введет в поле 'секретный код' код полученый в смс
    То он увидит надпись "Номер телефона подтвержден"
