# language: ru

Функционал: Регистрация водителя и пользователя на сайте
  Как посетитель сайта
  Я хочу иметь возможность зарегистрироваться на сайте
  Чтобы пользоваться его функционалом

  Сценарий: Регистрация с ролью перевозчик
    Допустим я нажму на кнопку зарегистрироваться
    Если я введу данные
      | phone      | password  | password_confirmation | role                 |
      | 0555223344 | qweqwe    | qweqwe                | user_role_worker     |
    И нажму кнопку Зарегистрироваться
    То я увижу "Добро пожаловать! Вы успешно зарегистрировались."
    Если переходит на страницу своего профиля
    То я увижу свои данные
      | phone       | role       |
      | 0555223344  | worker     |

  Сценарий: Регистрация с ролью заказчик
    Допустим я нажму на кнопку зарегистрироваться
    Если я введу данные
      | phone       | password  | password_confirmation | role                     |
      | 0555556677  | qweqwe    | qweqwe                | user_role_customer       |
    И нажму кнопку Зарегистрироваться
    То я увижу "Добро пожаловать! Вы успешно зарегистрировались."
    Если переходит на страницу своего профиля
    То я увижу свои данные
      | phone       | role         |
      | 0555556677  | customer     |