# language: ru

Функционал: Регистрация водителя и пользователя на сайте
  Как посетитель сайта
  Я хочу иметь возможность зарегистрироваться на сайте
  Чтобы пользоваться его функционалом

  Сценарий: Регистрация с ролью перевозчик
    Допустим я нажму на кнопку зарегистрироваться
    Если я введу данные
      | email             | password  | password_confirmation | role                 |
      | email@example.com | qweqwe    | qweqwe                | user_role_worker     |
    И нажму кнопку Зарегистрироваться
    То я увижу "Добро пожаловать! Вы успешно зарегистрировались."
    Если переходит на страницу своего профиля
    То я увижу свои данные
      | email             | role       |
      | email@example.com | worker     |

  Сценарий: Регистрация с ролью заказчик
    Допустим я нажму на кнопку зарегистрироваться
    Если я введу данные
      | email             | password  | password_confirmation | role                     |
      | email@example.com | qweqwe    | qweqwe                | user_role_customer       |
    И нажму кнопку Зарегистрироваться
    То я увижу "Добро пожаловать! Вы успешно зарегистрировались."
    Если переходит на страницу своего профиля
    То я увижу свои данные
      | email             | role         |
      | email@example.com | customer     |