# language: ru

Функционал: Регистрация водителя и пользователя на сайте
  Как посетитель сайта
  Я хочу иметь возможность зарегистрироваться на сайте
  Чтобы пользоваться его функционалом

  Сценарий: Регистрация с ролью перевозчик
    Допустим я нажму на кнопку зарегистрироваться
    Если я введу данные
      | phone      | password  | password_confirmation | role                 |
      | 555223344  | qweqwe    | qweqwe                | user_role_worker     |
    И нажму кнопку Зарегистрироваться
    То я увижу "Добро пожаловать! Вы успешно зарегистрировались."
    Если переходит на страницу своего профиля
    То я увижу свои данные
      | phone       | role       |
      | 555223344   | worker     |

  Сценарий: Регистрация с ролью заказчик
    Допустим я нажму на кнопку зарегистрироваться
    Если я введу данные
      | phone       | password  | password_confirmation | role                     |
      | 555556677   | qweqwe    | qweqwe                | user_role_customer       |
    И нажму кнопку Зарегистрироваться
    То я увижу "Добро пожаловать! Вы успешно зарегистрировались."
    Если переходит на страницу своего профиля
    То я увижу свои данные
      | phone       | role         |
      | 555556677   | customer     |

  Сценарий: Регистрация с существующим номером в базе
    Допустим в приложении есть пользователь с номером "555555512"
    И я хочу зарегестрироваться как новый пользователь с данными
      | phone      | password  | password_confirmation | role                 |
      | 555555512  | qweqwe    | qweqwe                | user_role_worker     |
    То я получу ошибку о том что номер "уже существует"

  Сценарий: Номер должен быть числом
    Если я перейду на страницу регистрации
    И введу данные
      | phone      | password  | password_confirmation | role                 |
      | kfkdkkkkk  | qweqwe    | qweqwe                | user_role_worker     |
    То я получу ошибку что номер телефона "не является числом"