# language: ru

  Функционал: Управление пользователями
    Как администратор
    Я хочу иметь возможность управлять пользователями
    Чтобы добавлять, изменять и удалять пользователей

    @javascript
    Сценарий: Создание водителя:
      Допустим захожу на страницу администратора
      И нажимаю кнопку Add users
      И перехожу на страницу cоздания пользователя
      И ввожу данные
        |name  | surname | phone    |
        |Peter | Jackson | 05554342 |
      Если нажму кнопку  Create User
      То меня перенаправит на список всех водителей
      И я увижу созданного водителя "Peter" в списке

    Сценарий: Изменение данных в водителе
      Допустим захожу на страницу администратора
      И нажимаю кнопку Edit у первого водителя
      И введу новые данные
        | name  | surname | phone     |
        | Guffy | Dog     | 099932323 |
      Если я нужму кнопку Update User
      То меня перенаправит на списко всех водителей
      И я увижу измененого водителя "Guffy" в списке