# language: ru

Функционал: : Пользователи оставляют друг другу отзывы
  Для того, чтобы у пользователей был рейтинг
  Я хочу иметь возможность оставлять отзыв
  В качестве водителя или клиента

  Предыстория:
    Дано в приложении есть заказчик
    И у заказчика есть заказ
    Также в приложении есть перевозчик
    И у перевозчика есть предложение с ценой "80 000"
    И заказчик выбрал предложение перевозчика
    И перевозчик выполнил работу

  Сценарий: Водитель оставляет отзыв о клиенте
    Тогда водитель заходит в систему
    И водитель перейдёт на страницу просмотра завершённого заказа
    И увидит форму оставления отзыва
    Если он оставит отзыв "Хороший клиент" оценка "5"
    То отзыв "Хороший клиент" оценка "5" будет виден на странице заказа

  @wip
  @javascript
  Сценарий: Клиент оставляет отзыв о водителе
    Тогда клиент заходит в систему
    И заходит на страницу просмотра выполненного заказа
    И увидит форму оставления отзыва
    Если он оставит отзыв "Хороший перевозчик" оценка "5"
    То отзыв "Хороший перевозчик" оценка "5" будет виден на странице заказа
