# language: ru

Функционал: Управление пользователями
  Как администратор
  Я хочу иметь возможность управлять пользователями
  Чтобы добавлять, изменять и удалять пользователей
  Как гость
  Я хочу иметь возможность зарегестрироваться
  Чтобы затем заходить на сайт

  @javascript
  Сценарий: Создание водителя:
    Допустим захожу на страницу администратора
    И нажимаю кнопку Add users
    И на странице создания пользователя ввожу данные
      | email       | name  | surname | phone    | password | password_confirmation |
      | ppp@mail.ru | Peter | Jackson | 05554342 | qweqwe   | qweqwe                |
    Если нажму кнопку  Create User
    И я увижу созданного водителя "Peter" на странице всех водителей

  @javascript
  Сценарий: Изменение данных в водителе
    Допустим захожу на страницу администратора
    И нажимаю кнопку Edit у первого водителя
    И введу новые данные
      | email       | name  | surname | phone    | password | password_confirmation |
      | qqq@mail.ru | Guffy | Dog     | 05wefd42 | qweqwe   | qweqwe                |
    Если я нужму кнопку Update User
    То я увижу измененого водителя "Guffy" на странице всех водителей

  @javascript
  Сценарий: Регистрация на сайте
    Допустим я захожу на главную страницу
    И нажимаю кнопку Sign up
    И на странице регистрации ввожу данные
      | email        | password | password_confirmation |
      | test@test.tt | qweqwe   | qweqwe                |
    Если я нажму кнопку Sign up
    То увижу свой email "test@test.tt" в навбаре