# language: ru

Функционал: Водитель даёт своё предложение клиенту
  Как водитель
  Я хочу иметь возможность добавлять предложение цены заказчику
  В случае необходимости менять или удалять предложение

  Предыстория:
    Дано в приложении есть заказчик
    И у заказчика есть заказ
    И в приложении есть перевозчик
    И он заходит в систему

  Сценарий: Перевозчик даёт свою цену на заказ
    Если он переходит на страницу открытого к предложениям заказа
    То он видит форму оставления предложения
    Если он оставит своё предложение с ценой "100 000"
    То предложение с ценой "100 000" будет видно под заказом

  Сценарий: Перевозчик изменяет сумму в своём предложении
    Дано у перевозчика есть предложение с ценой "100 000"
    Если он поменяет своё предложение на "80 000"
    То предложение с ценой "80 000" будет видно под заказом

  Сценарий: Перевозчик удаляет своё предложение
    Дано у перевозчика есть предложение с ценой "100 000"
    Если он удалит своё предложение
    То он видит форму оставления предложения