# language: ru

Функционал: Водитель добавляет машину
  Как водитель
  Я хочу иметь возможность
  Добавить автомобиль
  Изменить автомобиль
  Удалить автомобиль

  Сценарий: Добавление автомобиля водителем
    Если я захожу на сайт как водитель с email "worker0@mail.com" password "qweqwe"
    И я перейду на страницу моего профиля
    И создам машину с данными
      | desc        | weight | volume     | load_type | car_type |
      | TOYOTA F100 | 10т.   | 120 кубов. | верхняя   | трал     |
    То я увижу машину c этими параметрами в своём профиле
      | desc        | weight | volume     | load_type | car_type |
      | TOYOTA F100 | 10т.   | 120 кубов. | верхняя   | трал     |

  Сценарий: Изменение параметра автомобиля водителем
    Если я захожу на сайт как водитель с email "worker0@mail.com" password "qweqwe"
    И я перейду на страницу моего профиля
    И создам машину с данными
      | desc        | weight | volume     | load_type | car_type |
      | TOYOTA F100 | 10т.   | 120 кубов. | верхняя   | трал     |
    И решу изменить данные
      | desc        | weight | volume    | load_type | car_type |
      | TOYOTA F101 | 20т.   | 86 кубов. | задняя    | другое   |
    То я увижу машину c этими параметрами в своём профиле
      | desc        | weight | volume    | load_type | car_type |
      | TOYOTA F101 | 20т.   | 86 кубов. | задняя    | другое   |

  Сценарий: Удаление автомобиля водителем
    Если я захожу на сайт как водитель с email "worker0@mail.com" password "qweqwe"
    И я перейду на страницу моего профиля
    И создам машину с данными
      | desc        | weight | volume     | load_type | car_type |
      | TOYOTA F100 | 10т.   | 120 кубов. | верхняя   | трал     |
    И удалю автомобиль
    То увижу надпись "Вы не добавили ни одну машину"