# language: ru

Функционал: Водитель добавляет машину
  Как водитель
  Я хочу иметь возможность
  Добавить автомобиль
  Изменить автомобиль
  Удалить автомобиль

  @wip
  Сценарий: Перевозчик добавляет себе автомобиль
    Допустим в приложении есть перевозчик
    Если он заходит в систему
    И переходит на страницу своего профиля
    И создаст машину с данными
      | desc        | weight | volume     | load_type | car_type |
      | TOYOTA F100 | 10т.   | 120 кубов. | верхняя   | трал     |
    То он увидит машину c этими параметрами в своём профиле
      | desc        | weight | volume     | load_type | car_type |
      | TOYOTA F100 | 10т.   | 120 кубов. | верхняя   | трал     |


  Сценарий: Перевозчик меняет данные своего автомобиля
    Допустим в приложении есть перевозчик, с автомобилем
    И у перевозчика есть машина
    Если он решит изменить данные машины
    То переходит на страницу своего профиля
    И в форме изменения параметров автомобиля
      | desc        | weight | volume    | load_type | car_type |
      | TOYOTA F101 | 20т.   | 86 кубов. | задняя    | другое   |
    То я увижу машину c этими параметрами в своём профиле
      | desc        | weight | volume    | load_type | car_type |
      | TOYOTA F101 | 20т.   | 86 кубов. | задняя    | другое   |

  Сценарий: Админ редактирует данные пользователя
    Допустим есть пользователь с именем "Джон Траволта", чьи данные я хочу отредактировать
    Если я перехожу на страницу редактирования данных пользователя
    И меняю имя пользователя на "Иван", фамилию на "Иванов", email на "ivan@mail.ru", пароль на "ivan_password"
    То данные этого пользователя изменятся

  Сценарий: Удаление автомобиля водителем
    Если я захожу на сайт как водитель с email "worker0@mail.com" password "qweqwe"
    И я перейду на страницу моего профиля
    И создам машину с данными
      | desc        | weight | volume     | load_type | car_type |
      | TOYOTA F100 | 10т.   | 120 кубов. | верхняя   | трал     |
    И удалю автомобиль
    То увижу надпись "Вы не добавили ни одну машину"