# language: ru

Функционал: Водитель добавляет машину
  Как водитель
  Я хочу иметь возможность
  Добавить автомобиль
  Изменить автомобиль
  Удалить автомобиль


  Сценарий: Перевозчик добавляет себе автомобиль
    Допустим в приложении есть перевозчик
    Если он заходит в систему
    И переходит на страницу своего профиля
    И создаст машину
    То он увидит эту машину в своём профиле


  Сценарий: Перевозчик меняет данные своего автомобиля
    Допустим в приложении есть перевозчик
    И у перевозчика есть машина
    Если он заходит в систему
    И переходит на страницу редактирования автомобиля
    И меняет название на "TOYOTA" грузоподъёмность "20т." объём "86 кубов." загрузка "задняя" тип "другое"
    То данные машины изменятся на "TOYOTA" "20т." "86 кубов." "задняя" "другое"


  Сценарий: Перевозчик удаляет свой автомобиль
    Допустим в приложении есть перевозчик
    И у перевозчика есть машина
    Если он заходит в систему
    И переходит на страницу своего профиля
    И удаляет автомобиль
    То увидит надпись "Вы не добавили ни одну машину"