# language: ru

Функционал: Водитель даёт своё предложение клиенту
  Как водитель
  Я хочу иметь возможность добавлять предложение цены заказчику
  В случае необходимости менять или удалять предложение

  Предыстория:
    Дано в приложении есть заказчик
    И у заказчика есть заказ
    И в приложении есть перевозчик
    И он заходит в систему
@todo
  Сценарий: Перевозчик даёт свою цену на заказ
    Если он переходит на страницу открытого к предложениям заказа
    То видит форму оставления предложения
    Если он оставит своё предложение
    То оно будет видно на странице просмотра заказа

#  Сценарий: Изменение цены в предложении
#
#
#  Сценарий: Удаление предложения